{"pages":[{"title":"Categories","text":"","link":"/categories/index.html"},{"title":"Tags","text":"","link":"/tags/index.html"},{"title":"About","text":"","link":"/about/index.html"}],"posts":[{"title":"5 Reasons to Learn German","text":"If you’re thinking about learning a new language, German could well make an excellent choice. It may not leap to mind as an exciting language to have in your arsenal, but hear us out… While German doesn’t have the romantic allure of French, or be considered a business asset like Chinese, the language wins hands down once you start considering its other strengths. If you’re worried we going to say you should learn German because 120 million native speakers worldwide, fear not. Below, we’ve covered the five most interesting reasons why German should take pride of place on your skills list. 1 German has an enormous cultural heritageThere’s no getting away from the fact that a large percentage of the world’s most impressive achievements were first conceived of in the German language. Everything from music to science and literature to opera has deep roots in this rich and flexible language. Musically, German can lay claim to most of the classical greats, including Beethoven, Bach, Handel, Mozart and Brahms. Vienna, the capital of Austria and a German-speaking city through and through, has long been considered the world’s musical heart. On the science front, there’s the most famous scientist ever to live, Einstein, but also contemporary scientists who are making huge contributions to our current lives. For example, a German was recently responsible for discovering the newest elements on the Periodic Table. You’ll never run out of books to read in German, particularly if you like your literature deep and philosophical: Goethe, the Brothers Grimm, Hermann Hesse, Ernst Jünger and Patrick Süskind are just a few names to get you started. 2 German is a very distinctive languageAlthough there are several languages that have Germanic roots, none are quite as distinctive as German itself. One of the main reasons for this is the language’s common use of extremely long compound words. Today, the longest of these is ‘rindfleischetikettierungsüberwachungsaufgabenübertragungsgesetz’, an impressive 64 characters long - which translates into English as “beef labelling supervision duty assignment law”. (If you’re wondering, ‘Rind fleisch’ means beef flesh, ‘etikettierungs’ means labelling, ‘Überwachungs’ means supervision, ‘aufgaben’ means duties, ‘Übertragung’ means assignment and ‘gesetz’ means law). Try slipping that into conversation! German is a living language, and as one of the only languages in the world that allows such outrageously lengthy compound words, it’s anybody’s guess as to what the next contender for the dubiously honorable title of Longest German Word might be. 3 German is beating everyone else onlineThe Internet has a lot to offer the fluent German speaker. After the .com domain, those websites ending with .de (the German equivalent of .co.uk) are the most populous. In fact, since .com doesn’t really ‘belong’ to one country (although it’s obviously the token domain of America), that makes Germany the country with the largest number of national domains. Just imagine what you’d be able to find on the 8.1 million new domains suddenly available to you! To give you an idea of just how far ahead .de is, its closest competitor is .co.uk with a paltry 31,900,000 websites to call its own. Furthermore, German domain names are also more popular than .net, .org, and .info extensions. 4 It’s a breeze to learnWell, maybe not a breeze, but for the English speaker, German is often surprisingly easy to master. This is because the two languages have the same Germanic roots. In comparison, French, Italian and Spanish are known as the Romance languages and function very differently to English, making them much harder to learn. This interesting table suggests that 40% of German words are similar to their English sounding counterparts. So, for example, ‘bruder’ and ‘vater’, which mean brother and father, are much more recognizable than the French equivalents of ‘père’ and ‘frère’. While we’re on the subject of learning languages, mastering German will also improve your English. According to the American Association of Teachers of German, “vocabulary skills in English, a better understanding of the English language itself, improved literacy, higher reading achievement as well as enhanced listening skills and memory have been shown to correlate with German language study”. 5 You’ll always have someone to speak toGerman speakers are some of the most well-traveled people in the world. Wherever you go, you’ll find a German-speaking tourist to confide in. In particular, it is the Germans themselves that really know how to travel: with about 6 weeks annual leave and plenty of disposable income, they have the time and the means to visit the further corners of the globe. German people spend more on foreign travel than those of any other nation; in 2007, they spent an astounding 91 billion Euros on international travel!","link":"/2018/12/25/5-reasons-to-learn-german/"},{"title":"CMake | Checking Platform","text":"Platform Variables CMake System There are several different ways to check the current system/platform in CMake, and each interacts with cross-compiling in different ways. Platform VariablesCMake sets certain variables to true depending on the current platform and toolchain in use. These always describe the target platform. UNIX : is TRUE on all UNIX-like OS’s, including Apple OS X and CygWin WIN32 : is TRUE on Windows. Prior to 2.8.4 this included CygWin APPLE : is TRUE on Apple systems. Note this does not imply the system is Mac OS X, only that APPLE is #defined in C/C++ header files. MINGW : is TRUE when using the MinGW compiler in Windows MSYS : is TRUE when using the MSYS developer environment in Windows CYGWIN : is TRUE on Windows when using the CygWin version of cmake CMake SystemA cleaner and more cross-compiling-compatible way to check the current platform is through the CMAKE_SYSTEM variables. CMAKE_SYSTEM : the complete system name, e.g. “Linux-2.4.22”, “FreeBSD-5.4-RELEASE” or “Windows 5.1” CMAKE_SYSTEM_NAME : The name of the system targeted by the build. The three common values are Windows, Darwin, and Linux, though several others exist, such as Android, FreeBSD, and CrayLinuxEnvironment. Platforms without an operating system, such as embedded devices, are given Generic as a system name. CMAKE_SYSTEM_VERSION : Version of the operating system. Generally the kernel version. CMAKE_SYSTEM_PROCESSOR : the processor name (e.g. “Intel(R) Pentium(R) M processor 2.00GHz”) CMAKE_HOST_SYSTEM_NAME : The name of the system hosting the build. Has the same possible values as CMAKE_SYSTEM_NAME.","link":"/2018/12/25/cmake-checking-platform/"},{"title":"German for English Speakers","text":"BASICS The German Alphabet Special pronunciations Germanic Umlaut When to write ss and when to use ß? Typing German characters on non-German keyboards Pronunciation: Consonants Pronunciation: Vowels The refinement of the site of Peter Lewis, Click here to browse BASICSThe German AlphabetSpecial pronunciationsThere are 4 special pronunciations (ä, ö, ü, ß) in German alphabet, but they aren’t really part of the full-fledged letters, because they’re not in the alphabet song that German children learn, they don’t have their own sections in a dictionary, and they don’t occur at the beginning of many common words. The capital ẞ was declared an official letter of the German alphabet on 29 June 2017, and ß is not a real letter, just a ligature for (or stylized way of writing) a double lowercase s. Germanic UmlautThe original purpose of a Germanic umlaut was to shift from a “back vowel” to a “front vowel” to make a “derivative form” of a word easier to pronounce (1), usually because it was adding another syllable. For example, alt (old) &rarr; älter (older). Words that don’t follow the rule (1), as above, appear in modern German because: extra syllable has been dropped, as in many noun plurals. the root form has fallen out of use. they’re been used to approximate a foreign pronunciation, like militär. more complex reasons, e.g. für comes from vor, but even native speakers don’t usually think of them as related. The more you can visualize the umlaut forms of a word as “shifted” rather than as a whole separate word, the easier it will be to remember them. When to write ss and when to use ß?The rules for this have changed in recent years, but the current practice is to use ss after short vowels, and ß after long vowels and diphthongs (vowel combinations). But if you’re ever in doubt, write ss. It’s more acceptable to replace a ß with a double s than the other way around. There is no difference in how they’re pronounced. In Switzerland the ß is not used at all. Typing German characters on non-German keyboardsIf you’re using a keyboard without these symbols, you can type ae, oe and ue instead of ä, ö and ü, and of course ss instead of ß: On Mac: For ä, ö, ü, type Option-U (tells Mac to add Umlaut), then type a, o, u. For ß, type Option-S. On Windows: To be honest, the whole process on Windows is so annoying that most users who have to type any serious amount of German text will be better off just switching their keyboard layout. Click here for instructions on how to switch your keyboard layout in Windows. Pronunciation: Consonants b, d, g : are softened to p, t, k, at the end of a syllable. j : like the English y. kn, pf, ps : just get ready to say a p with your lips closed, and say the second letter instead, letting it force them open a bit. v : like the English f. w : like the English v. z : is pronounced like ts. qu : is pronounced like kv. s : like the English z. however, like the s in English, before another consonant. sp-, st- : is pronounced like shp-, sht-, at the beginning of a syllabel. ss : like English ss. The most difficult sounds in German are R and CH. They come in multiple varieties: r at the end : like the English uh (e.g. der sounds like day-uh), pronounced very weakly. r at the beginning : is pronounced at the back of the throat. hard ch : after a, o, u, au (e.g. auch, doch, ach). soft ch : after any other vowel (e.g. ich, dich), or at the beginning of a few words (China, Chemie). greek ch : is identical to a k sound (e.g. chaos, charakter, sechs). foreign ch : keep their original ch sounds. Pronunciation: Vowels These are eight standard German vowels – the same five as in English (a, i, e, o, u) plus the three umlaut vowels ä, ö and ü – and they each have a “long” and a “short” variant. Vowels are marked as long by being doubled, like in Staat (state), or by adding an h after a vowel, like in Stahl (steel). In general, a vowel is long when followed by a single consonant and short when followed by a combination of consonants. There are some exceptions to this rule, but they mainly involve unstressed syllables and short grammatical words (e.g. in, das, von). Also keep in mind that most German syllables that begin with a vowel are led off by a glottal stop. An example of a glottal stop is the break in the middle of “uh-oh” – or, for British readers, the way Cockney speakers swallow their Ts. a : a in the English father. ä : a in the British English hair. e : a in the English day. i : ee in the English team, meet. o : o in the English no. ö : o in the English worst, worry. u : oo in the English moon. ü : the same with Chinese Pinyin. The other basic vowels sounds are as follows: y : long ü, (e.g. typisch), in words of Greek origin. e : unstressed uh, (e.g. bitte), at the end of a word. ie : long i, (and unstressed yeh at the end of a word). au : ow in the English cow. äu &amp; eu : oy in the English toy. ei, ey, &amp; ai : i in the English fight.","link":"/2018/12/26/german-for-english-speakers/"},{"title":"CMake Manual","text":"Basics 1 Hello World 1.1 Creating an Executable 1.2 Binary Directory 1.3 In-Place &amp; Out-of-Source Build Build the Example 2. Hello World with Headers 2.1 Directory Paths 2.2 Source Files Variable 2.3 Including Directories CMake Community Wiki. Basics1 Hello WorldDirectory structure for this example is below:1234/|--CMakeLists.txt|-- main.cpp|-- header.h Content of CMakeLists.txt is below:123CMAKE_MINIMUM_REQUIRED(VERSION 3.5)PROJECT(HelloWorld)ADD_EXECUTABLE(${ProjectName} main.cpp) 1.1 Creating an ExecutableThe add_executable() command specifies that an executable should be build from the specified source files, in this example main.cpp. The first argument to the add_executable() function is the name of the executable to be built, and the second argument is the list of source files to compile. In this example, the project() function, will create a variable ${PROJECT_NAME} with the value HelloWorld. This can then be passed to the add_executable() function to output a ‘HelloWorld’ executable. 1.2 Binary DirectoryThe root or top level folder that you run the cmake command from is known as your CMAKE_BINARY_DIR and is the root folder for all your binary files. CMake supports building and generating your binary files both in-place and also out-of-source which is highly recommended. 1.3 In-Place &amp; Out-of-Source BuildIn-place builds generate all temporary build files in the same directory structure as the source code. This means that all Makefiles and object files are interspersed with your normal code. Out-of-source builds allow you to create a single build folder that can be anywhere on your file system. All temporary build and object files are located in this directory keeping your source tree clean. To create an out-of-source build run the cmake command in the build folder and point it to the directory with your root CMakeLists.txt file. Using out-of-source builds if you want to recreate your cmake environment from scratch, you only need to delete your build directory and then rerun cmake. Build the Example12345&gt;&gt; mkdir build&gt;&gt; cd build&gt;&gt; cmake .. -G \"Visual Studio 15 2017 Win64\"&gt;&gt; cmake --build .&gt;&gt; ./HelloWorld 2. Hello World with HeadersDirectory structure for this example is below:1234567/|--CMakeLists.txt|-- include| |-- Hello.h|-- src |-- Hello.cpp |-- main.cpp Content of CMakeLists.txt is below:123456789CMAKE_MINIMUM_REQUIRED(VERSION 3.5)PROJECT(HelloWorld)SET(SRC_LIST src/Hello.cpp src/main.cpp)ADD_EXECUTABLE(${ProjectName} ${SRC_LIST})TARGET_INCLUDE_DIRECTORIES(${ProjectName} PRIVATE ${PROJECT_SOURCE_DIR}/include) 2.1 Directory PathsCMake syntax specifies a number of variables which can be used to help find useful directories in your project or source tree. Some of these include: Variable Information CMAKE_SOURCE_DIR The root source directory CMAKE_CURRENT_SOURCE_DIR The current source directory if using sub-projects and directories PROJECT_SOURCE_DIR The source directory of the current cmake project CMAKE_BINARY_DIR The root binary / build directory. This is the directory where you ran the cmake command CMAKE_CURRENT_BINARY_DIR The build directory you are currently in PROJECT_BINARY_DIR The build directory for the current project| 2.2 Source Files VariableCreating a variable which includes the source files allows you to be clearer about these files and easily add them to multiple commands, for example, the add_executable() function. 123456# Create a sources variable with a link to all cpp files to compileSET(SOURCES src/Hello.cpp src/main.cpp)ADD_EXECUTABLE(${PROJECT_NAME} ${SOURCES}) Note! : An alternative to setting specific file names in the SOURCES variable is to use a GLOB command to find files using wildcard pattern matching. FILE(GLOB SOURCES &quot;src/*.cpp&quot;) Tip : For modern CMake it is NOT recommended to use a variable for sources. Insead it is typical to directly declare the sources in the add_xxx function. This is particularly important for glob commands which may not always show you the correct results if you add a new source file. 2.3 Including DirectoriesWhen you have different include folders, you can make your compiler aware of them using the target_include_directories() function. When compiling this target this will add these directories to the compiler with the -I flag e.g. -I/directory/path 12TARGET_INCLUDE_DIRECTORIES(target PRIVATE ${PROJECT_SOURCE_DIR}/include) The PRIVATE identifier specifies the scope of the include. This is important for libraries and there are two other identifiers of scope (INTERFACE and PUBLIC). Scope Description PRIVATE the directory is added to this target’s include directories INTERFACE the directory is added to the include directores for any targets that link this library PUBLIC As above, it is included int his library and also any targets that link this library","link":"/2018/12/09/cmake-manual/"},{"title":"C++内存对象模型","text":"1 普通继承（非虚继承） 1.1 单继承 1.2 多继承 1.3 菱形继承 2 虚继承 2.1 虚单继承 2.2 虚多继承 2.3 虚菱形继承 在C++对象模型下，nonstatic 数据成员被置于每一个类对象中，而static数据成员被置于类对象之外。static与nonstatic函数也都放在类对象之外，而对于virtual 函数，则通过虚函数表+虚指针来支持： 每个类生成一个表格，称为虚表（virtual table，简称vtbl）。虚表中存放着一堆指针，这些指针指向该类每一个虚函数。虚表中的函数地址将按声明时的顺序排列 每个类对象都拥有一个虚表指针(vptr)，由编译器为其生成。虚表指针的设定与重置皆由类的复制控制（也即是构造函数、析构函数、赋值操作符）来完成。vptr的位置为编译器决定，传统上它被放在所有显示声明的成员之后，不过现在许多编译器把vptr放在一个类对象的最前端（也就是说对象的地址就是vptr的地址） 虚函数表的前面设置了一个指向type_info的指针，用以支持RTTI（Run Time Type Identification，运行时类型识别）。RTTI是为多态而生成的信息，包括对象继承关系，对象本身的描述等，只有具有虚函数的对象在会生成。 1 普通继承（非虚继承）1.1 单继承注：派生类中新增的虚函数追加到虚函数表后面 123456789101112131415class Base{public: Base (int a = 1):base(a){} virtual void fun0(){cout &lt;&lt; base &lt;&lt; endl;} int base;};class Derive:public Base{public: Derive (int a = 2):derive(a){} virtual void fun0(){}; virtual void fun1(){cout &lt;&lt; derive &lt;&lt; endl;} int derive;}; 1.2 多继承注：派生类中新增的虚函数，追加到第一个基类的虚函数表的后面 123456789101112131415161718192021class Base1{public: Base1 (int a = 2):base1(a){} virtual void fun1(){cout &lt;&lt; base1 &lt;&lt; endl;} int base1;};class Base2{public: Base2 (int a = 3):base2(a){} virtual void fun2(){cout &lt;&lt; base2 &lt;&lt; endl;} int base2;};class Derive: public Base1, public Base2{public: Derive (int value = 4):derive (value){} virtual void fun3(){cout &lt;&lt; derive &lt;&lt; endl;} int derive;}; 1.3 菱形继承注：分析时，由上到下依次分析。存在二义性和内存冗余问题 12345678910111213141516171819202122232425262728class Base{public: Base (int a = 1):base(a){} virtual void fun0(){cout &lt;&lt; base &lt;&lt; endl;} int base;};class Base1:public Base{public: Base1 (int a = 2):base1(a){} virtual void fun1(){cout &lt;&lt; base1 &lt;&lt; endl;} int base1;};class Base2:public Base{public: Base2 (int a = 3):base2(a){} virtual void fun2(){cout &lt;&lt; base2 &lt;&lt; endl;} int base2;};class Derive: public Base1, public Base2{public: Derive (int value = 4):derive (value){} virtual void fun3(){cout &lt;&lt; derive &lt;&lt; endl;} int derive;}; 2 虚继承2.1 虚单继承与普通的包含虚函数的单继承相比，派生类拥有自己的虚函数表以及虚函数表指针，而不是与基类共用一个虚函数表。注意虚函数表指针和虚基类表指针的存储顺序 1234567891011121314class Base{public: Base (int a = 1):base(a){} virtual void fun0(){cout &lt;&lt; base &lt;&lt; endl;} int base;};class Base1:virtual Base{public: Base1 (int a = 2):base1(a){} virtual void fun1(){cout &lt;&lt; base1 &lt;&lt; endl;} int base1;}; 下图是不包含虚函数的虚单继承： 2.2 虚多继承12345678910111213141516171819202122class Base1{public: Base1 (int a = 2):base1(a){} virtual void fun1(){cout &lt;&lt; base1 &lt;&lt; endl;} int base1;};class Base2{public: Base2 (int a = 3):base2(a){} virtual void fun2(){cout &lt;&lt; base2 &lt;&lt; endl;} int base2;};class Derive:virtual public Base1, virtual public Base2{public: Derive (int value = 4):derive (value){} virtual void fun3(){cout &lt;&lt; derive &lt;&lt; endl;} int derive;}; 下图是不包含虚函数的虚多继承： 2.3 虚菱形继承12345678910111213141516171819202122232425262728class Base{public: Base (int a = 1):base(a){} virtual void fun0(){cout &lt;&lt; base &lt;&lt; endl;} int base;};class Base1:virtual public Base{public: Base1 (int a = 2):base1(a){} virtual void fun1(){cout &lt;&lt; base1 &lt;&lt; endl;} int base1;};class Base2:virtual public Base{public: Base2 (int a = 3):base2(a){} virtual void fun2(){cout &lt;&lt; base2 &lt;&lt; endl;} int base2;};class Derive: public Base1, public Base2{public: Derive (int value = 4):derive (value){} virtual void fun3(){cout &lt;&lt; derive &lt;&lt; endl;} int derive;}; 下图是不包含虚函数的虚菱形继承（类型1 - 中虚）： 下图是不包含虚函数的虚菱形继承（类型1 - 全虚）：","link":"/2018/12/31/C-内存对象模型/"},{"title":"Git Manual","text":"Config Branch Clone 查询branch 修改branch Checkout Misc For the teams I work with, we follow the design philosophy of Git: Anything in the master branch is deployable. To work on something new, create a descriptively named branch off of master. Commit to that branch locally and regularly push your work to the same named branch on the server. When you need feedback or help, or you think the branch is ready for merging, open a pull request. After someone else has reviewed and signed off on the feature, you can merge it into master. Once it is merged and pushed to ‘master’, you can and should deploy immediately. Config –system 对系统的所有用户有效，该配置文件存放在/etc/gitconfig（基于Window系统下的C:/Program Files/Git/mingw64/） –global 对当前用户的所有repo有效，该配置文件存放在~/.gitconfig（用户的home目录下） –local 对当前repo有效，该配置文件存放在每个repo的.git/config中 1234567891011121314151617181920#显示当前Git的配置文件（.gitconfig）&gt;&gt; git config --list#显示当前的Git用户名&gt;&gt; git config user.name# 设置push的默认工作模式为“只push当前branch”&gt;&gt; git config --global push.default current# 手动修改配置&gt;&gt; git config --global -e# 设置用户信息&gt;&gt; git config --global user.name \"xavier\"&gt;&gt; git config --global user.email \"123@email.com\"# 指定文本编辑器&gt;&gt; git config --global core.editor '.../nodepad++.exe' -multiInst -notabbar -nosession -noPlugin# 指定diff工具&gt;&gt; git config --global merge.tool vimdiff# 为Git命令创建别名&gt;&gt; git config --global alias.ci commit&gt;&gt; git config --global alias.amend ci --amend&gt;&gt; git config --global alias.co checkout&gt;&gt; git config --global alias.st status Branch Git branches are effectively a pointer to a snapshot of your changes. Instead of copying files from directory to directory, Git stores a branch as a reference to a commit. In this sense, a branch represents the tip of a series of commits—it’s not a container for commits. The history for a branch is extrapolated through the commit relationships. Clone123456# 指定clone深度为1（减少版本信息的传输），clone指定的branch&gt;&gt; git clone &lt;url&gt; --depth 1 -b &lt;branch or tag&gt; # clone时指定用户名和密码&gt;&gt; git clone https://user-name:password@&lt;remote repo&gt;# 指定clone到哪里&gt;&gt; git clone &lt;url&gt; . 查询branch1234567891011121314151617# 列出所有的本地branch&gt;&gt; git branch -i : 大小写不敏感地排序branch名 -r : 列出远端的branch -a : 列出本地和远端的branch -v : 列出最后一次的commit信息 -vv : 列出最后一次的commit信息，和存在跟踪关系的远端分支 --no-abbrev : 显示完整的SHA而不是默认的前7个字符# 列出匹配成功的branch&gt;&gt; git branch --list \"*zhuwa*\" \"*chenda*\"# 基于当前branch的commit创建新branch&gt;&gt; git branch &lt;name&gt;# 列出包含有指定commit的branch&gt;&gt; git branch --contains &lt;commit&gt;# 列出merge到该commit的所有branch&gt;&gt; git branch --merged &lt;commit&gt; 修改branch12345678910# 关联远端branch&gt;&gt; git branch --set-upstream-to=&lt;url&gt;# 和远端branch解除跟踪关系&gt;&gt; git branch --unset-upstream# 删除本地branch&gt;&gt; git branch -d &lt;name&gt;# 删除远端branch&gt;&gt; git push origin :&lt;url&gt;# 修改branch的描述信息&gt;&gt; git branch --edit-description Checkout In Git terms, a checkout is the act of switching between different versions of a target entity. The git checkout command operates upon three distinct entities: files, commits, and branches. git checkout, when used on branches, alters the target of the HEAD ref. It can be used to create branches, switch branches, and checkout remote branches. Misc1234567# 使用默认浏览器打开指定命令的帮助文档&gt;&gt; git &lt;verb&gt; --help&gt;&gt; git help &lt;verb&gt;# 生成一个可发布的压缩包&gt;&gt; git archive# 查看提交历史&gt;&gt; git log --oneline","link":"/2018/12/04/git-manual/"},{"title":"The Power Of Nostalgia","text":"It may surprise you to know that in the 1600s nostalgia was classified as a neurologic disorder that occurred mainly within soldiers who were spending many years abroad away from their home. ‘Nostos’ is a word for homecoming and ‘Algos’ is a word for pain, when you combine those you get ‘nostalgia’. Fast forwarding to the 19th and 20th centuries, nostalgis became now classified as a psychological disorder where experts thought if their patients spent too much time thinking about the past, they weren’t living in the present and that was a disease. In 2018, we have realized that is not the case. Nostalgia can be a very positive emotion that is stabilizing to us during times of change and transition. As humans we need nostalgia to constantly remind us of meaning in our lives, and those of us who never experienced nostalgia are actually a little bit worse than those who experience on a regular basis. That warm comforting feeling that you get when you reminisce about something that happened in the past, that’s nostalgis. What brings on nostalgia?Science tells us that during moments of change and transition, we’re most likely to experience the feelings of nostalgia. They’re calming, they give us motivation to get through whatever challenges lay ahead of us. It’s not so much that we look at the presidents, “oh, this is awful, it used to be so much better back then”, it’s about finding meaning in what we’ve accomplished in the past to allow us to be more motivated and accomplish our goals in the future. It’s really a positive emotion and has sort of been ill-defined in the past. Interestingly, your senses are very well connected to that part of your brain if you were to smell something you’ve connected with a past memory that could trigger feelings of nostalgia. You smell the cologne or perfume on somebody and it brings you back to an experience that you had with a partner in your early years, that’s nostalgia. Hearing a song brings you back to wherever you first heard that song, that’s nostalgia in full effect, and I would say music is probably the most common trigger of that. Is nostalgia always a good thing?The feelings of nostalgia are generally good, but there is a thin line there where it can become pathologic or a bad thing. Take for instance, someone who has historical nostalgia which is where they live in the present, but they hate everything about it and want it to be more like the past, they’ll do anything to disconnect themselves from the present and try to make things like how they used to be. There’s certain times where you can do that in a positive way where you can take aspects of things that were great in the past and bring them to the present or even the future, but there’s also bad ways of doing that. It’s important to note that with every good things, too much of it, can be a bad thing. Think of one of your greatest memories. In fact, think of any memory. Doesn’t it seem like you were having an amazing time? Doesn’t it seem like it can’t compare to the present? When thinking about the present, you inherently think about the future. The future carries stress and worry. Worry is the best way to keep happiness at bay (rhymed on purpose). On the other hand, when thinking about the past, you inherently AREN’T thinking about the future. This makes the past appear superior to the present, aka, nostalgia. Memory is an imperfect tool. We think about memory as being something very exact, a science. It’s not like that as all. The more you access a memory in the further away that memory is, the more likely it is you’re to change it and forget key details. Sometimes people refer to this as Rosy retrospection. Essentially what you are doing is exhibiting a cognitive bias when you’re thinking something was amazing, it might have been a stressful time if were to dive into your head in that given moment. You can actually see how this type of nostalgia or rosy retrospection can be a survival tool, because if you want to foster well-being in a society in your own mind, it’s best to not remember all those stressful details and instead bring that positive motivation forward. Essentially what you’re doing, as a human, is creating meaning for yourself in a world where it’s very easy to get lost and even confused at times.","link":"/2018/12/13/the-power-of-nostalgia/"},{"title":"CMake | Useful Variables","text":"Locations Environment Variables System &amp; Compiler Information Various Options Compilers and Tools Prefixes, Suffixes (Postfixes), and Extensions Locations CMAKE_BINARY_DIR : if you are building in-source, this is the same as CMAKE_SOURCE_DIR, otherwise this is the top level directory of your build tree CMAKE_COMMAND : this is the complete path of the cmake which runs currently (e.g. /usr/local/bin/cmake). Note that if you have custom commands that invoke cmake -E, it is very important to use CMAKE_COMMAND as the CMake executable, because CMake might not be on the system PATH. CMAKE_CURRENT_BINARY_DIR : if you are building in-source, this is the same as CMAKE_CURRENT_SOURCE_DIR, otherwise this is the directory where the compiled or generated files from the current CMakeLists.txt will go to. CMAKE_CURRENT_SOURCE_DIR : this is the directory where the currently processed CMakeLists.txt is located in CMAKE_CURRENT_LIST_FILE : this is the full path to the listfile currently being processed. CMAKE_CURRENT_LIST_DIR : (since 2.8.3) this is the directory of the listfile currently being processed. CMAKE_CURRENT_LIST_LINE : this is linenumber where the variable is used. CMAKE_FILES_DIRECTORY : the directory within the current binary directory that contains all the CMake generated files. Typically evaluates to “/CMakeFiles”. Note the leading slash for the directory. Typically used with the current binary directory, i.e. ${CMAKE_CURRENT_BINARY_DIR}${CMAKE_FILES_DIRECTORY} CMAKE_MODULE_PATH : tell CMake to search first in directories listed in CMAKE_MODULE_PATH when you use FIND_PACKAGE() or INCLUDE() 12SET(CMAKE_MODULE_PATH ${PROJECT_SOURCE_DIR}/MyCMakeScripts)FIND_PACKAGE(HelloWorld) CMAKE_ROOT : this is the CMake installation directory CMAKE_SOURCE_DIR : this is the directory which contains the top-level CMakeLists.txt, i.e. the top level source directory PROJECT_NAME : the name of the project set by PROJECT() command. CMAKE_PROJECT_NAME : the name of the first project set by the PROJECT() command, i.e. the top level project. PROJECT_BINARY_DIR : contains the full path to the top level directory of your build tree PROJECT_SOURCE_DIR : contains the full path to the root of your project source directory, i.e. to the nearest directory where CMakeLists.txt contains the PROJECT() command Environment VariablesThese are environment variables which effect cmake behaviour. CMAKE_INCLUDE_PATH : This is used when searching for include files e.g. using the FIND_PATH() command. If you have headers in non-standard locations, it may be useful to set this variable to this directory (e.g. /sw/include on Mac OS X). If you need several directories, separate them by the platform specific separators (e.g. “:” on UNIX) CMAKE_LIBRARY_PATH : This is used when searching for libraries e.g. using the FIND_LIBRARY() command. If you have libraries in non-standard locations, it may be useful to set this variable to this directory (e.g. /sw/lib on Mac OS X). If you need several directories, separate them by the platform specific separators (e.g. “:” on UNIX) CMAKE_PREFIX_PATH : (since CMake 2.6.0) This is used when searching for include files, binaries, or libraries using either the FIND_PACKAGE(), FIND_PATH(), FIND_PROGRAM(), or FIND_LIBRARY() commands. For each path in the CMAKE_PREFIX_PATH list, CMake will check “PATH/include” and “PATH” when FIND_PATH() is called, “PATH/bin” and “PATH” when FIND_PROGRAM() is called, and “PATH/lib” and “PATH” when FIND_LIBRARY() is called. See the documentation for FIND_PACKAGE(), FIND_LIBRARY(), FIND_PATH(), and FIND_PROGRAM() for more details. CMAKE_INSTALL_ALWAYS : If set during installation CMake will install all files whether they have changed or not. The default when this is not set is to install only files that have changed since the previous installation. In both cases all files are reported to indicate CMake knows they are up to date in the installed location. $ENV{name} : This is not an environment variable , but this is how you can access environment variables from cmake files. It returns the content of the environment variable with the given name (e.g. $ENV{PROGRAMFILES}) DESTDIR : If this environment variable is set it will be prefixed to CMAKE_INSTALL_PREFIX in places where it is used to access files during installation. This allows the files to be installed in an intermediate directory tree without changing the final installation path name. Since the value of CMAKE_INSTALL_PREFIX may be included in installed files it is important to use DESTDIR rather than changing CMAKE_INSTALL_PREFIX when it is necessary to install to a intermediate staging directory. System &amp; Compiler Information CMAKE_MAJOR_VERSION : major version number for CMake, e.g. the “2” in CMake 2.4.3 CMAKE_MINOR_VERSION : minor version number for CMake, e.g. the “4” in CMake 2.4.3 CMAKE_PATCH_VERSION : patch version number for CMake, e.g. the “3” in CMake 2.4.3 CMAKE_TWEAK_VERSION : tweak version number for CMake, e.g. the “1” in CMake X.X.X.1. Releases use tweak &lt; 20000000 and development versions use the date format CCYYMMDD for the tweak level. CMAKE_VERSION : The version number combined, eg. 2.8.4.20110222-ged5ba for a Nightly build. or 2.8.4 for a Release build. CMAKE_GENERATOR : the generator specified on the commandline. BORLAND : is TRUE on Windows when using a Borland compiler WATCOM : is TRUE on Windows when using the Open Watcom compiler MSVC, MSVC_IDE, MSVC60, MSVC70, MSVC71, MSVC80,CMAKE_COMPILER_2005, MSVC90, MSVC10 (Visual Studio 2010) : Microsoft compiler CMAKE_C_COMPILER_ID : one of “Clang”, “GNU”, “Intel”, or “MSVC”. This works even if a compiler wrapper like ccache is used. CMAKE_CXX_COMPILER_ID : one of “Clang”, “GNU”, “Intel”, or “MSVC”. This works even if a compiler wrapper like ccache is used. See the Checking the Current Platform page for a list of the variables pertaining to platform checks. Various Options CMAKE_SKIP_RULE_DEPENDENCY : set this to true if you don’t want to rebuild the object files if the rules have changed, but not the actual source files or headers (e.g. if you changed the some compiler switches) CMAKE_SKIP_INSTALL_ALL_DEPENDENCY : since CMake 2.1 the install rule depends on all, i.e. everything will be built before installing. If you don’t like this, set this one to true. CMAKE_INCLUDE_CURRENT_DIR : automatically add CMAKE_CURRENT_SOURCE_DIR and CMAKE_CURRENT_BINARY_DIR to the include directories in every processed CMakeLists.txt. It behaves as if you had used INCLUDE_DIRECTORIES in every CMakeLists.txt file or your project. The added directory paths are relative to the being-processed CMakeLists.txt, which is different in each directory. (See this thread for more details). CMAKE_INCLUDE_DIRECTORIES_PROJECT_BEFORE : order the include directories so that directories which are in the source or build tree always come before directories outside the project. CMAKE_VERBOSE_MAKEFILE : set this to true if you are using makefiles and want to see the full compile and link commands instead of only the shortened ones CMAKE_SUPPRESS_REGENERATION : this will cause CMake to not put in the rules that re-run CMake. This might be useful if you want to use the generated build files on another machine. CMAKE_COLOR_MAKEFILE : create Makefiles with colored output (defaults to on) CMAKE_SKIP_PREPROCESSED_SOURCE_RULES : (since 2.4.4) if set to TRUE, the generated Makefiles will not contain rules for creating preprocessed files (foo.i) CMAKE_SKIP_ASSEMBLY_SOURCE_RULES : (since 2.4.4) if set to TRUE, the generated Makefiles will not contain rules for creating compiled, but not yet assembled files (foo.s) Compilers and Tools BUILD_SHARED_LIBS : if this is set to ON, then all libraries are built as shared libraries by default. SET(BUILD_SHARED_LIBS ON) CMAKE_BUILD_TYPE : A variable which controls the type of build when using a single-configuration generator like the Makefile generator. It is case-insensitive. CMake will create by default the following variables when using a single-configuration generator: None (CMAKE_C_FLAGS or CMAKE_CXX_FLAGS used) Debug (CMAKE_C_FLAGS_DEBUG or CMAKE_CXX_FLAGS_DEBUG) Release (CMAKE_C_FLAGS_RELEASE or - CMAKE_CXX_FLAGS_RELEASE) RelWithDebInfo (CMAKE_C_FLAGS_RELWITHDEBINFO or CMAKE_CXX_FLAGS_RELWITHDEBINFO MinSizeRel (CMAKE_C_FLAGS_MINSIZEREL or CMAKE_CXX_FLAGS_MINSIZEREL) You can use these default compilation flags (or modify them) by setting the CMAKE_BUILD_TYPE variable at configuration time on the command line, or from within the “ccmake” GUI. Note! The default values for these flags change with different compilers. If CMake does not know your compiler, the contents will be empty. If you are using the Makefile generator, you can create your own build type like this: 123SET(CMAKE_BUILD_TYPE distribution)SET(CMAKE_CXX_FLAGS_DISTRIBUTION \"-O3\")SET(CMAKE_C_FLAGS_DISTRIBUTION \"-O3\") Note that CMAKE_BUILD_TYPE is not initialized with a readable value at configuration time. This is because the user is free to select a build type at build time. Use CMAKE_CFG_INTDIR if you need a variable that evaluates to the correct build time directory. CMAKE_CONFIGURATION_TYPES : When using a multi-configuration generator, such as the one for Visual Studio, this variable contains a list of the available configurations. CMAKE_C_COMPILER : the compiler used for C files. Normally it is detected and set during the CMake run, but you can override it at configuration time. Note! It can not be changed after the first cmake or ccmake run. Although the gui allows to enter an alternative, it will be ignored in the next ‘configure’ run. Use for example: CC=gcc-3.3 CXX=g++-3.3 cmaketo set the compiler. (You can also set CMAKE_C_COMPILER_INIT, before any PROJECT() or ENABLE_LANGUAGE() command.) Any other way (like writing make CC=gcc-3.3 CXX=g++-3.3) will not work. When using distcc or similar tools, you need to write: CC=&quot;distcc gcc-3.3&quot; CXX=&quot;distcc g++-3.3&quot; cmake However, this will empty all your CMAKE_…FLAGS… above. CMAKE_C_FLAGS : the compiler flags for compiling C sources. Note you can also specify switches with ADD_COMPILE_OPTIONS(). CMAKE_C_FLAGS_ : compiler flags for a specific build configuration. Replace “” in the name with a specific build configuration name. CMAKE_C_OUTPUT_EXTENSION : what C object files end in. Typically .o or .obj. CMAKE_CFG_INTDIR : meta-variable! Please note that this is an important variable, since on multi-configuration generators it will be generated into dynamically switched content based on the configuration that the user currently selected within the generated build environment. Indicates the name of the current configuration (~ directory) for the project. May be used for any purpose which needs per-configuration-dynamic switching of strings, not just OutputDir configuration. For multi-configuration generators (e.g. MSVC) the resulting strings are typically some of “Debug”, “Release”, “RelWithDebInfo”, or “MinSizeRel”. For other compiler generators (single-configuration ones) it is typically “.”, as they don’t use MSVC-style configuration directories. CMAKE_CXX_COMPILER : the compiler used for C++ files. Normally it is detected and set during the CMake run, but you can override it at configuration time. Note! It can not be changed after the first cmake or ccmake run. See CMAKE_C_COMPILER above. CMAKE_CXX_FLAGS : the compiler flags for compiling C++ sources. Note you can also specify switches with ADD_COMPILE_OPTIONS(). CMAKE_CXX_FLAGS_ : compiler flags for a specific configuration for C++ sources. Replace “” in the name with a specific build configuration name. CMAKE_SHARED_LINKER_FLAGS : additional compiler flags for building shared libraries, e.g.: set(CMAKE_SHARED_LINKER_FLAGS &quot;-Wl,--no-undefined&quot;) On Unix systems, this will make linker report any unresolved symbols from object files (which is quite typical when you compile many targets in CMake projects, but do not bother with linking target dependencies in proper order). On mac, the flag is -Wl,-undefined-error. Prefixes, Suffixes (Postfixes), and Extensions CMAKE_EXECUTABLE_SUFFIX : Suffix of executables on the target platform. CMAKE_FIND_LIBRARY_PREFIXES : List of possible library prefixes used by find_library(). “lib” on UNIX systems. CMAKE_FIND_LIBRARY_SUFFIXES : List of possible library suffixes used by find_library(). “.a;.so” on UNIX systems. Note that it’s possible to use this to control whether find_package() modules find shared or static libraries. CMAKE_&lt;SHARED|STATIC&gt;_LIBRARY_PREFIX : Prefix for shared or static libraries on this platform. Read-only. CMAKE_&lt;SHARED|STATIC&gt;_LIBRARY_SUFFIX : Suffix for shared or static libraries on this platform. Read-only. CMAKE_POSTFIX : Adds a custom “postfix” to static and shared libraries when in a certain build type. Example: Setting CMAKE_BUILD_TYPE=DEBUG and CMAKE_DEBUG_POSTFIX=&quot;_d&quot; would turn mylib.lib into mylib_d.lib.","link":"/2018/12/25/cmake-useful-variables/"},{"title":"Politics | Does the EU Really Need the UK?","text":"The UK needs the EU slightly more than they need the UK. What would the EU lose? access to a major trading partner. 13% of their budget. an important ally when it comes to security. What would the UK lose? single market access to a trading block which makes up about 50% of their international trade. an important security alliance although they get to keep 136 million pounds a week, that will almost definitely be cancelled out by lost of economic growth at least in the short term. Trade Dependency The UK is the second biggest country in the EU at about 2.2 trillion pounds after Germany which has an economy at about 3.1 trillion pounds. When you combine the economic power of all of the member nations, the EU as a whole, has an economy worth about 14.6 trillion pounds. As I’m sure you’ve heard a million times before, the EU is obviously a far larger block than the UK in terms of people and the size of economy, but this doesn’t necessarily mean that the UK needs the EU more than the EU needs the UK. A more reliable indicator might be how much each side relies on the other for trade. In 2007, 53% of UK imports, worth 257 billion pounds, came from the EU, and 44% of the UK’s exports, worth 162 billion pounds, went to the EU, that’s a lot of the UK’s trade. It is sort of true that the UK is relying less on the EU for the trade than they used to do. While the UK is starting to export more to the rest of the world, the UK are simultaneously increasing the amount we export to the EU according to HMRC. In 2011, the EU made up about 51% of the UK’s imports, in 2017, it was 53%, and it might still be rising according to HMRC. In the years since May 2017, the UK imported 55% of their goods from the EU and exported 51% of their goods to the EU. Also, these numbers don’t even include countries, like Norway or Switzerland, who aren’t part of the EU but are within the EU regulatory framework. The Rotterdam Effect Some people argue the UK actually does less trade with the EU than the numbers might say because of the Rotterdam Effect. Basically, Britain sends some of their exports destined for non-EU countries through Rotterdam ports before they go on to their intended destination, the same things happens to imports, with some of their imports passing through Rotterdam before they head to the United Kingdom. This is counted as EU trade when it could or maybe even should be counted as non-EU trade. Though it’s hard to quantify how much of an impact this has, the ONS have estimated that it could affect 2% of UK-EU trade. Even without the Rotterdam effects, it’s pretty clear that the UK needs the EU quite a bit when it comes to trade. But, let’s see how much it works the other way around. If we don’t look at countries within the EU27, the UK is the second biggest export market for goods placing behind the US, as of 2017. Trade with the UK makes up about 16% of the goods that the EU exports to non-EU27 countries. However, it’s important to note that this isn’t really fair given the UK is currently within the single market, they’ve got a competitive advantage against all other non-EU trading partners. If the UK were to leave the single market customs union and free trade area, that number would almost certainly drop, when you include EU27 countries within the analysis, like economic powerhouses, Germany and France. the UK makes up about 8% of the EU’s exports and about 4% of the imports. When it comes to trade, it looks like the UK needs the EU much more than the EU need the UK. German Car Industry One quick thing we need to cover, it’s such a cliche, but we really do have to deal with it, people in favor of brexit love to bring up the EU won’t let us leave and unfavorable terms as the German car industry relies on us too much. It’s pretty easy to understand why the German car industry is brought up so regularly as it’s a huge industry worth an estimated 482.7 billions euros in 2016, and when you consider some of the mammoth car brands who manufacture in Germany, that’s hardly surprising. So, should these companies really be shaking in their boots? A lot of their cars do end up in the UK, the United Kingdom is actually their biggest market, buying 769,000 German cars a year, far ahead of the US who’s in the second place importing 494,000 cars a year. This makes life difficult for German Chancellor, Angela Merkel, she said, back in 2016, that she didn’t want industry bosses interfering with the delicate negotiations. But she also doesn’t want it to look like she isn’t protecting German businesses and jobs that said, if the UK leaves with no deal at all, it could seriously affect the German supply chain. With the CEO of the German lobbying group who represents BMW, Volkswagen and Daimler, saying that the supply chains could be torn apart. Despite this, he claims that the UK will be hit harder than Germany with jobs and production facilities being moved from the UK back to the EU after brexit, and this isn’t just hypothetical job losses, a number of car companies have said that they’re not investing in the UK or pulling investment due to brexit and the uncertainty around it. This is actually very important for the UK where the top four areas of manufacturing are all related to the manufacturing of vehicles. The EU BudgetAnother reason that’s often given when people say that the EU needs the UK is the money that the UK contributes the EU budget. So, how much does the UK actually pay the EU? Well, for starters, it’s not the 350 million pounds per week that certain buses might have you believe that all amounts a little over 18 billion pounds a year which is what the UK would pay if they didn’t have a rebate. The RebateThe rebate was negotiated by Thatcher in 1984, it was basically because, back then, about 70% of the EU budget was spent on the common agricultural policy, and most of this money went on subsidizing French farming, while the UK didn’t get much out of it at all because of the complicated way that funding allocation is calculated. But what it basically boiled down to was the UK hasn’t got as many fields as France, and as such, doesn’t get as much money. The UK obviously didn’t like subsidizing inefficient French farmers, so they negotiated a rebate which means that the UK doesn’t pay as much as we would otherwise. Most EU countries obviously hate this, but it sort of makes sense, the Common Agricultural Policy still accounts for 37% of the EU’s expenditure and the UK still doesn’t get much money from it. The rebate essentially saves the UK a lot of money, about 4 billion pounds each year, so they end up paying more like 14 billion pounds in the EU’s budget each year which comes to about 250 million pounds a week. This accounts for about 13% of the EU’s budget, making the UK the third biggest contributor after France and Germany, and one of the only ten net countributors, by net contributor, what we mean is the UK is spending more into the EU than they get back. The UK gets back about 5 billion pounds in public sector spending and about a billion more in private sector credits with all these counted, the UK pays about 136 million pounds a week to the EU. The EU budget might be a little tighter and they might have to ask more countries to countribute a bit more money, but countries such as Finland have already said that they’re happy to put a bit more in to cover the hole left by the UK. So far, it looks like the EU might be alright without us. The Security However. there’s one area in which the EU might need the UK, and that security while there isn’t an EU army just yet, there are some EU security programs like Europol and the european arrest warrant. All EU states also have access to the second generation Schengen information system, the European criminal records information system, the europol information system, and any information which is shared as a result of pruem decisions, a commitment towards better cross-border cooperation on DNA fingerprints and vehicle registration information, the EU also has a common security and defence policy, at the moment, the UK is one of the biggest militaries in the EU and one of the intelligence services in the world, they play a big role in EU security.","link":"/2018/12/08/politics-does-the-eu-really-need-the-uk/"}],"tags":[{"name":"German","slug":"German","link":"/tags/German/"},{"name":"CMake","slug":"CMake","link":"/tags/CMake/"},{"name":"C++","slug":"C","link":"/tags/C/"},{"name":"Git","slug":"Git","link":"/tags/Git/"},{"name":"English","slug":"English","link":"/tags/English/"},{"name":"Brexit","slug":"Brexit","link":"/tags/Brexit/"}],"categories":[{"name":"German","slug":"German","link":"/categories/German/"},{"name":"SW","slug":"SW","link":"/categories/SW/"},{"name":"C++","slug":"C","link":"/categories/C/"},{"name":"English","slug":"English","link":"/categories/English/"}]}